#include "common.h"

// 显示菜单函数
void showMainMenu()
{
    system("cls");

    std::cout << "-------------------------------------------------------" << std::endl;
    std::cout << "|================ 欢迎使用X记账簿 =================|" << std::endl;
    std::cout << "|                                                     |" << std::endl;
    std::cout << "|***************     1 记  账     ********************|" << std::endl;
    std::cout << "|***************     2 查  询     ********************|" << std::endl;
    std::cout << "|***************     3 退  出     ********************|" << std::endl;
    std::cout << "|_____________________________________________________|" << std::endl;
    std::cout << "\n请选择(1 - 3):";
}
void showAccountMenu()
{
    system("cls");
    std::cout << "-------------------------------------------------------" << std::endl;
    std::cout << "|===============   选择记账种类   ====================|" << std::endl;
    std::cout << "|                                                     |" << std::endl;
    std::cout << "|***************    1 收  入      ********************|" << std::endl;
    std::cout << "|***************    2 支  出      ********************|" << std::endl;
    std::cout << "|***************    3 返回主菜单  ********************|" << std::endl;
    std::cout << "|_____________________________________________________|" << std::endl;

    std::cout << "\n请选择(1 - 3):\n";
}
void showQueryMenu()
{
    system("cls");
    std::cout << "-------------------------------------------------------" << std::endl;
    std::cout << "|===============   选择查询条件   ====================|" << std::endl;
    std::cout << "|                                                     |" << std::endl;
    std::cout << "|***************  1 统计所有账目  ********************|" << std::endl;
    std::cout << "|***************  2 统 计 收 入   ********************|" << std::endl;
    std::cout << "|***************  3 统 计 支 出   ********************|" << std::endl;
    std::cout << "|***************  4 返回主菜单    ********************|" << std::endl;
    std::cout << "|_____________________________________________________|" << std::endl;
    std::cout << "\n请选择(1 - 4):\n";
}
